import React from 'react';

function Join() {
    return <div class="wrap">
        <h2>招聘职位</h2>
        <h3>web前端讲师</h3>
        <h4>工作内容</h4>
        <p>1. 讲解本科目相关的技术课程；</p>
        <p>2. 积极学习与研发本课程相关的技术</p>
        <p>3. 对学员的满意度和职业技能成长负责；</p>
        <h4>任职要求</h4>
        <p>1. 5 年以上的前端开发经验；（能力突出者可适度放低）</p>
        <p>2. 国家正规院校大学本科或以上学历，计算机或相关专业毕业；（能力突出者可适度放低）</p>
        <p>3. 熟悉 H5 + CSS3 新标准和新增API，可以编写符合 W3C 标准的解构。</p>
        <p>4. JavaScript 基础扎实，可以用原生JS进行项目开发。</p>
        <p>5. 拥抱行业变换，熟悉 ES6 + 规范及新增 API。</p>
        <p>6. 有工程化开发经验，对自动化测试、部署有实际开发经验</p>
        <p>7. 对 Vue 或 React 等 MVVM 框架有实际项目经验(通读过源码更佳)</p>
        <p>8. 有 node.js、 PHP、Java 等后端语言有实际项目经验</p>
        <p>9. 熟悉常用设计模式，如观察者、发布订阅、工厂模式、单例模式；</p>
        <p>10. 有数据可视化开发经验（如 canvas、svg、three.js、D3.js）者，优先考虑;</p>
        <p>11. 有 WEB移动端实际开发经验，RN，Flutter，uni-app最少掌握其一;</p>
        <p>12. 有良好沟通能力，较强的文档能力，乐于分享、有责任心，团队协作能力；</p>
        <h3>WEB前端助教</h3>
        <h4>工作内容</h4>
        <p>1. 负责收集解答学员日常学习问题；</p>
        <p>2. 负责整理收集最新面试动向。</p>
        <h4>任职要求</h4>
        <p>1、前端基础扎实，对html、css、原生JavaScript 有不错的功底。</p>
        <p>2、熟练使用Vue 或者 React。</p>
        <p>4、有可视化、node、小程序等功底是很好的加分项。</p>
        <p>5. 喜欢教育行业、有较强的求知欲望、喜欢分享。</p>
        <p>6. 表达能力优秀，能使用清晰明了、通俗易懂的方式向受众阐述观点。</p>
    </div>
}

export default Join;