//
// Created by JakePrim on 2021/7/28.
//
#include <stdio.h>

int main() {

    int a[] = {10,11};
    int b[] = {20};
    int c[] = {30};

    //指针数组 数组存放的是指针类型  64位 相差8个字节
    int * d[] = {a, b, c};//指针数组 存放的是a的地址 *d == &a  **d = *(&a)  &a = &a[0]  *(&a[0])
    printf("&a[0]=%p,&d[0]=%p,d[0]=%d,*(&a[0])=%d\n",&a,*d,**d,*(&a[0]));
    //&a=000000000061FE1C,&d[0]=000000000061FE1C,d[0]=10,*(&a[0])=10

    //*d+1  *d = &a[0]  *d+1 = &a[0]+1
    printf("&a[1]=%p,&d[0]=%p,a[1]=%d\n",&a+1,*d+1,*(*d+1));
    //&a[1]=000000000061FE20,&d[0]=000000000061FE1C,a[1]=11

    //如果要取a[0] 不能写 *(&a) 要改为 *(&a[0])
    printf("%d,&a[0]=%p,&a=%p\n",*(&a[0]+1),&a[0],&a);//11 &a[0]=000000000061FE18,&a=000000000061FE18

    //推断 *d[0] = **d  *d[1] = **(d+1)   *d = &a
    printf("d[0]=%d,%d,d[1]=%d,%d\n",*d[0],**d,**(d+1),*d[1]);//d[1]=20,20

    //**(d+1) == *(*(d+1))
    printf("%d\n",*(*(d+1)));

    return 0;
}

